/*2․էկրանին տպել 100֊ից 200֊ի միջակայքում ընկած պատահական թիվ, 
    ամեն վայրկյան այդ թիվը պակասի 5-ով, 
    իսկ երբ հասնի 50֊ի էկրանին տպվի այդ մասին հաղորդագրություն։ */


// var x = Math.floor(Math.random() * (200-100) + 100);
// setInterval(function(){ 
//     while(x>=55){
//         x-=5;
//         console.log(x);
//         break
//     }
// }, 1000);





/* 3. Գրել ֆուկցիա, որը կվերադարձնի զանգվածում կրկնվող էլեմնտների քանակ։*/

// var array = [5, 9, 50, 9, 55, 41, 9, 9];
// var i = 0;
// var x =0;
// var y = x+1;
// for(x = 0; x<array.length; x++){
//         if(array[x]===array[y]){
//             i++
//         }
// }
// alert("9 թիվը կրկնվում է " + i + " անգամ")





/*4.Գրել ֆուկցիա, որը կմիացնի 2 զանգվածների տարրերը բացի կրկնվողներից, և կվերադարձնի 
արդյունքը(օրինակ․ arr1 =[5,3,8,2], arr2 = [3,-5,8,10,7], result [5,3,8,2,-5,10,7])*/

// var arr1 = [65, 68, 23, 84];
// var arr2 = [23, -50, 68, 20, 84];
// var result = [ ];
// result.unshift(arr1, arr2);
// alert(result);

// for(x=0; x<arr1.length; x++){
//     for(y=0; y<arr2.length; y++){
//         if(arr1[x] === arr2[y]){
//             arr1.splice(x)
//         }
//     }
// }
// alert(result)






